templates/floating_hull/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5.0;

deltaT          0.001;

writeControl    runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           1.0;
maxAlphaCo      1.0;

maxDeltaT       1;

functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        patches         (hull);
        rho             rhoInf;
        log             yes;
        rhoInf          1025;
        CofR            (67.5 0 2); // Update CofR to match CoM
    }

    sixDoFState
    {
        type            sixDoFRigidBodyMotionState;
        libs            ("libsixDoFRigidBodyMotion.so");
        writeControl    timeStep;
        writeInterval   1;
        velocity        yes;
        acceleration    yes;
        log             yes;
    }
}

// ************************************************************************* //
