templates/floating_hull/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ( "libsixDoFRigidBodyMotion.so" );

solver          sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (hull);
    innerDistance   5;
    outerDistance   20;

    mass            2000000; // 2000 tons
    centreOfMass    (67.5 0 2); // Midship approx
    momentOfInertia (5000000 50000000 50000000); 

    report          on;
    accelerationRelaxation 0.7;
    accelerationDamping    0.9;
    
    // ODE Solver for the Rigid Body
    solver
    {
        type Newmark;
    }


    
    // Simpler way: constraints list.
    constraints
    {
       // Lock Sway (Translation Y)
       XZPlane
       {
           sixDoFRigidBodyMotionConstraint plane;
           normal (0 1 0); 
           anchor (67.5 0 2);
       }
       
       // Lock Yaw (Rotation Z) and Roll (Rotation X) -> Allow Pitch (Rotation Y)
       // "axis" constraint: rotation allowed only around axis.
       rotationAxis
       {
           sixDoFRigidBodyMotionConstraint axis;
           axis (0 1 0); // Allow rotation around Y (Pitch)
       }
    }
}

// ************************************************************************* //
